[
  {"word": "Mango", "meaning": "A sweet tropical fruit with a yellow or orange color when ripe."},
  {"word": "Tomato", "meaning": "A red or yellowish fruit with a juicy pulp, often used as a vegetable in cooking."},
  {"word": "Banana", "meaning": "A long curved fruit that grows in clusters and has soft pulpy flesh and yellow skin when ripe."},
  {"word": "Table", "meaning": "A piece of furniture with a flat top supported by legs, used for holding or displaying objects."},
  {"word": "Chair", "meaning": "A seat with a back, typically for one person."},
  {"word": "Book", "meaning": "A written or printed work consisting of pages glued or sewn together along one side and bound in covers."},
  {"word": "Pen", "meaning": "An instrument for writing or drawing with ink."},
  {"word": "Computer", "meaning": "An electronic device for storing and processing data, typically in binary form, according to instructions given to it in a variable program."},
  {"word": "Phone", "meaning": "A telecommunications device that permits two or more users to conduct a conversation when they are too far apart to be heard directly."},
  {"word": "Car", "meaning": "A road vehicle, typically with four wheels, powered by an internal combustion engine or electric motor and able to carry a small number of people."},
  {"word": "House", "meaning": "A building for human habitation, especially one that is lived in by a family or small group of people."},
  {"word": "Tree", "meaning": "A woody perennial plant, typically having a single stem or trunk growing to a considerable height and bearing lateral branches."},
  {"word": "River", "meaning": "A large natural stream of water flowing in a channel to the sea, a lake, or another such stream."},
  {"word": "Mountain", "meaning": "A large natural elevation of the earth's surface rising abruptly from the surrounding level; a large steep hill."},
  {"word": "Cloud", "meaning": "A visible mass of condensed water vapor floating in the atmosphere, typically high above the general level of the ground."},
  {"word": "Sun", "meaning": "The star at the center of the solar system, a hot ball of glowing gases."},
  {"word": "Moon", "meaning": "The natural satellite of the earth, visible (chiefly at night) by reflected light from the sun."},
  {"word": "Star", "meaning": "A fixed luminous point in the night sky that is a large, remote incandescent body like the sun."},
  {"word": "Clock", "meaning": "An instrument for measuring and indicating time."},
  {"word": "Lamp", "meaning": "An electric light bulb or a device containing an electric light bulb."},
  {"word": "Key", "meaning": "A small piece of shaped metal with incisions or projections that when inserted into a lock and turned, operates it."},
  {"word": "Door", "meaning": "A hinged, sliding, or revolving barrier at the entrance to a building, room, or vehicle, or in the aperture of a container."},
  {"word": "Window", "meaning": "An opening in the wall or roof of a building or vehicle that is fitted with glass or other transparent material in a frame to admit light or air and allow people to see out."},
  {"word": "Ball", "meaning": "A round object that is solid or hollow and that is kicked, thrown, or hit in a game."},
  {"word": "Hat", "meaning": "A shaped covering for the head worn for warmth, as a fashion item, or as part of a uniform."},
  {"word": "Shoes", "meaning": "Footwear consisting of a sole and typically a protective toe cap and heel."},
  {"word": "Shirt", "meaning": "A cloth garment for the upper part of the body, typically with a collar and sleeves, and with buttons or a similar fastening."},
  {"word": "Pants", "meaning": "An outer garment covering the body from the waist to the ankles, with a separate part for each leg."},
  {"word": "Bag", "meaning": "A flexible container with an opening at the top, used for carrying things."},
  {"word": "Watch", "meaning": "A small timepiece carried or worn on the person."},
  {"word": "Mirror", "meaning": "A reflective surface, now typically of glass coated with a metal amalgam, that reflects a clear image."},
  {"word": "Brush", "meaning": "An implement with a handle, typically with bristles, hair, or wire, used for cleaning, applying a substance, or smoothing or arranging the hair."},
  {"word": "Comb", "meaning": "A toothed strip of plastic, metal, or other material for untangling or arranging the hair."},
  {"word": "Soap", "meaning": "A substance used with water for washing and cleaning, made of a compound of natural oils or fats with sodium hydroxide or another strong alkali, and typically perfumed."},
  {"word": "Towel", "meaning": "A piece of thick absorbent cloth or paper used for drying oneself or wiping things dry."},
  {"word": "Plate", "meaning": "A flat dish, typically circular and made of china, from which food is eaten or served."},
  {"word": "Fork", "meaning": "An implement with two or more prongs used for lifting food to the mouth or holding it when cutting."},
  {"word": "Knife", "meaning": "An instrument with a blade and a handle, used for cutting or as a weapon."},
  {"word": "Spoon", "meaning": "An implement consisting of a small shallow bowl on a handle, used in eating, stirring, and serving food."},
  {"word": "Cup", "meaning": "A small bowl-shaped container for drinking from, typically having a handle."},
  {"word": "Glass", "meaning": "A hard, brittle, typically transparent or translucent substance made by fusing sand with soda and lime and cooling rapidly."},
  {"word": "Bottle", "meaning": "A container, typically made of glass or plastic, with a narrow neck, used for storing liquids."},
  {"word": "Box", "meaning": "A container with a flat base and sides and a removable or hinged lid."},
  {"word": "Paper", "meaning": "Thin material produced by pressing together wet fibers of cellulose pulp derived from wood, rags, or grasses, and drying them into flexible sheets."},
  {"word": "Pencil", "meaning": "An instrument for writing or drawing, consisting of a thin stick of graphite or a similar substance enclosed in a wooden or other casing."},
  {"word": "Eraser", "meaning": "A piece of rubber or other substance used for rubbing out pencil or ink marks."},
  {"word": "Glue", "meaning": "An adhesive substance used for joining materials together."},
  {"word": "Scissors", "meaning": "An instrument used for cutting cloth, paper, and other thin materials, consisting of two blades with handles pivoted together."},
  {"word": "Rope", "meaning": "A length of thick strong cord made by twisting together strands of hemp, sisal, nylon, or similar material."},
  {"word": "Hammer", "meaning": "A tool with a heavy metal head mounted at right angles at the end of a handle, used for jobs such as breaking things, driving in nails, and beating metals."},
  {"word": "Nail", "meaning": "A small metal spike with a broadened flat head, driven into wood to join things together or to serve as a hook."},
  {"word": "Screw", "meaning": "A metal pin or bolt with a helical thread and a head, used to fasten objects together by being rotated."},
  {"word": "Wire", "meaning": "A thin, flexible thread of metal."},
  {"word": "Brick", "meaning": "A rectangular block of fired or sun-dried clay, used for building walls, pavements, and other structures."},
  {"word": "Stone", "meaning": "The hard, solid, nonmetallic mineral matter of which rock is made, especially as a material for building or shaping."},
  {"word": "Sand", "meaning": "A loose granular substance, typically pale yellowish brown, resulting from the erosion of siliceous rocks and forming a major constituent of beaches, riverbeds, the seabed, and deserts."},
  {"word": "Soil", "meaning": "The upper layer of earth in which plants grow, a black or dark brown material typically consisting of a mixture of organic remains, clay, and rock fragments."},
    {"word": "Pillow", "meaning": "A cushion to support the head, especially in bed."},
    {"word": "Blanket", "meaning": "A large piece of woolen or similar material used as a covering to keep someone warm, especially in bed."},
    {"word": "Bed", "meaning": "A piece of furniture for sleeping or resting on, typically consisting of a mattress and a frame."},
    {"word": "Sofa", "meaning": "A long upholstered seat with a back and arms, for two or more people."},
    {"word": "Couch", "meaning": "Another term for sofa."},
    {"word": "Rug", "meaning": "A floor covering made of thick woven material."},
    {"word": "Carpet", "meaning": "A thick woven material used to cover a floor."},
    {"word": "Curtain", "meaning": "A piece of material suspended at the top to form a screen, typically one at a window that can be drawn back or sideways to leave the window visible."},
    {"word": "Blinds", "meaning": "A screen for a window, especially one consisting of adjustable horizontal slats."},
    {"word": "Fan", "meaning": "A device with revolving vanes that is used to cool or circulate air."},
    {"word": "Heater", "meaning": "An apparatus for heating a room or building."},
    {"word": "Air conditioner", "meaning": "A system for controlling the humidity and temperature of air in a building or vehicle, typically by cooling it."},
    {"word": "Television", "meaning": "A system for transmitting visual images and sound that are reproduced on screens, chiefly used to broadcast programs for entertainment, information, and education."},
    {"word": "Radio", "meaning": "The transmission and reception of electromagnetic waves of radio frequency."},
    {"word": "Remote control", "meaning": "A device that can be used to control a machine or apparatus from a distance."},
    {"word": "Keyboard", "meaning": "A panel of keys that operate a computer or typewriter."},
    {"word": "Mouse", "meaning": "A small hand-held device that controls the movement of a cursor or pointer on a computer display."},
    {"word": "Monitor", "meaning": "A device that displays images generated by a computer or other electronic device."},
    {"word": "Printer", "meaning": "A machine that prints text or pictures onto paper, especially one linked to a computer."},
    {"word": "Scanner", "meaning": "A device that examines, reads, or records data from something."},
    {"word": "Camera", "meaning": "A device for recording visual images in the form of photographs, film, or video signals."},
    {"word": "Microphone", "meaning": "An instrument for converting sound waves into electrical energy variations which may then be amplified, transmitted, or recorded."},
    {"word": "Speaker", "meaning": "A device that converts electrical energy into sound."},
    {"word": "Headphones", "meaning": "A pair of small loudspeakers held close to a person's ears, especially for listening to audio equipment such as a radio or personal stereo."},
    {"word": "Charger", "meaning": "A device for charging a battery or battery-powered equipment."},
    {"word": "Cable", "meaning": "A thick rope made of wires twisted together."},
    {"word": "Adapter", "meaning": "A device that allows connection between pieces of equipment that would otherwise be incompatible."},
    {"word": "Plug", "meaning": "A fitting with two or three pins inserted into a socket to make an electrical connection."},
    {"word": "Socket", "meaning": "A device into which an electric plug is inserted."},
    {"word": "Switch", "meaning": "A device for making and breaking the connection in an electric circuit."},
    {"word": "Bulb", "meaning": "A rounded glass housing for an electric lamp, typically pear-shaped and fitted into a socket."},
    {"word": "Wire", "meaning": "A thin, flexible thread of metal."},
    {"word": "Pipe", "meaning": "A tube used to convey water, gas, oil, or other fluid."},
    {"word": "Faucet", "meaning": "A tap from which a liquid flows or can be regulated."},
    {"word": "Sink", "meaning": "A basin with a water supply and drain, used for washing."},
    {"word": "Toilet", "meaning": "A fixed receptacle into which a person urinates or defecates, typically flushed with water."},
    {"word": "Shower", "meaning": "A device that releases a spray of water for a person to stand under to wash."},
    {"word": "Bathtub", "meaning": "A large container for holding water in which a person may bathe."},
    {"word": "Mirror", "meaning": "A reflective surface, now typically of glass coated with a metal amalgam, that reflects a clear image."},
    {"word": "Towel rack", "meaning": "A frame or bar on which towels can be hung."},
    {"word": "Toothbrush", "meaning": "A brush with a long handle, used for cleaning the teeth."},
    {"word": "Toothpaste", "meaning": "A paste used with a toothbrush for cleaning the teeth."},
    {"word": "Shampoo", "meaning": "A fluid used for washing the hair."},
    {"word": "Conditioner", "meaning": "A substance used after shampooing to make the hair softer and more manageable."},
    {"word": "Razor", "meaning": "An instrument with a sharp blade or a combination of blades, used to remove unwanted hair from the body."},
    {"word": "Comb", "meaning": "A toothed strip of plastic, metal, or other material for untangling or arranging the hair."},
    {"word": "Brush", "meaning": "An implement with a handle, typically with bristles, hair, or wire, used for cleaning, applying a substance, or smoothing or arranging the hair."},
    {"word": "Deodorant", "meaning": "A substance applied to the body to prevent or mask body odor caused by bacterial breakdown of perspiration."},
    {"word": "Perfume", "meaning": "A fragrant liquid typically made from essential oils extracted from flowers and spices, used to give a pleasant smell to one's body or clothes."},
    {"word": "Makeup", "meaning": "Cosmetics such as lipstick or powder applied to the face, used to enhance or alter the appearance."},
    {"word": "Mirror", "meaning": "A reflective surface, now typically of glass coated with a metal amalgam, that reflects a clear image."},
    {"word": "Cabinet", "meaning": "A cupboard with drawers or shelves for storing or displaying articles."},
    {"word": "Drawer", "meaning": "A boxlike container without a lid, into which articles can be put."},

    {"word": "Shelf", "meaning": "A flat length of wood or other rigid material, attached to a wall or forming part of a piece of furniture, that is used to hold or display objects."},
      {"word": "Backpack", "meaning": "A bag with shoulder straps that allow it to be carried on one's back."},
      {"word": "Wallet", "meaning": "A pocket-sized flat case for holding money, credit cards, and identification documents."},
      {"word": "Purse", "meaning": "A small bag or pouch, especially one used by a woman to carry personal items."},
      {"word": "Umbrella", "meaning": "A portable, handheld device used for protection against rain or sun, typically consisting of a fabric canopy stretched over a collapsible frame."},
      {"word": "Sunglasses", "meaning": "Glasses with tinted lenses to protect the eyes from sunlight."},
      {"word": "Flashlight", "meaning": "A small portable electric light."},
      {"word": "Battery", "meaning": "A container consisting of one or more cells, in which chemical energy is converted into electricity and used as a source of power."},
      {"word": "Ruler", "meaning": "A straight strip of material, typically marked at regular intervals, used for measuring lengths."},
      {"word": "Compass", "meaning": "An instrument containing a magnetized pointer that shows the direction of magnetic north and bearings from it."},
      {"word": "Map", "meaning": "A diagrammatic representation of an area of land or sea showing physical features, cities, roads, etc."},
      {"word": "Globe", "meaning": "A spherical or rounded object."},
      {"word": "Telescope", "meaning": "An optical instrument designed to make distant objects appear nearer, containing an arrangement of lenses, or of curved mirrors and lenses, by which rays of light are collected and focused to form a magnified image."},
      {"word": "Microscope", "meaning": "An optical instrument used for viewing very small objects, such as mineral samples or animal or plant cells, typically magnified hundreds of times."},
      {"word": "Thermometer", "meaning": "An instrument for measuring and indicating temperature."},
      {"word": "Scale", "meaning": "An instrument for weighing."},
      {"word": "Magnifying glass", "meaning": "A lens that produces an enlarged image of an object."},
      {"word": "Notebook", "meaning": "A book of plain paper or ruled paper for writing notes in."},
      {"word": "Calculator", "meaning": "A small machine used for basic arithmetic."},
      {"word": "Stapler", "meaning": "A machine with a spring-operated mechanism for driving staples into paper or other materials to fasten them together."},
      {"word": "Tape", "meaning": "A narrow strip of flexible material, typically used to fasten or bind something."},
      {"word": "Glue stick", "meaning": "A solid stick of adhesive used for sticking paper and other materials together."},
      {"word": "Marker", "meaning": "A pen with a broad felt tip that produces a thick line."},
      {"word": "Crayon", "meaning": "A stick of colored wax, used for drawing."},
      {"word": "Paint", "meaning": "A colored substance which is spread over a surface and dries to leave a thin decorative or protective coating."},
      {"word": "Canvas", "meaning": "A strong, coarse unbleached cloth made from hemp, flax, cotton, or a similar yarn, used to make sails, tents, and bags."},
      {"word": "Easel", "meaning": "A support for displaying something, typically a picture on an artist's canvas."},
      {"word": "Palette", "meaning": "A thin board or slab on which an artist lays and mixes colors."},
      {"word": "Clay", "meaning": "A stiff, sticky fine-grained earth, typically yellow, red, or bluish-gray in color, that can be molded when wet, and is dried and baked to make bricks, pottery, and ceramics."},
      {"word": "Pottery", "meaning": "Pots, dishes, and other articles made of earthenware or baked clay."},
      {"word": "Sculpture", "meaning": "The art of making two- or three-dimensional representative or abstract forms, especially by carving stone or wood or by casting metal or plaster."},
      {"word": "Yarn", "meaning": "Spun thread used for knitting, weaving, or sewing."},
      {"word": "Needle", "meaning": "A very slender piece of polished metal with a sharp point and an eye for thread, used in sewing."},
      {"word": "Thread", "meaning": "A long, thin strand of cotton, nylon, or other fibers used in sewing or weaving."},
      {"word": "Button", "meaning": "A small disk or knob sewn onto a garment to fasten it by being pushed through a buttonhole."},
      {"word": "Zipper", "meaning": "A device consisting of two flexible strips of metal or plastic with interlocking projections closed or opened by a slide, used to fasten garments, bags, and other items."},
      {"word": "Fabric", "meaning": "Cloth produced by weaving or knitting textile fibers."},
      {"word": "Sewing machine", "meaning": "A machine with a mechanically driven needle for sewing or stitching cloth."},
      {"word": "Knitting needles", "meaning": "Long, thin, pointed rods used for knitting."},
      {"word": "Crochet hook", "meaning": "A hooked needle used for crocheting."},
      {"word": "Basket", "meaning": "A container used to hold or carry things, typically made from interwoven strips of cane or wire."},
      {"word": "Candle", "meaning": "A cylinder or block of wax or tallow with a central wick that is lit to produce light."},
      {"word": "Vase", "meaning": "A decorative container, typically made of glass or ceramic, used for holding cut flowers or as an ornament."},
      {"word": "Clock", "meaning": "An instrument for measuring and indicating time."},
      {"word": "Calendar", "meaning": "A chart or series of pages showing the days, weeks, and months of a particular year, or giving particular seasonal information."},
      {"word": "Alarm clock", "meaning": "A clock that can be set to sound an alarm at a particular time."},
      {"word": "Safe", "meaning": "A strong fireproof cabinet with a complex lock, used for storing valuables."},
      {"word": "Lock", "meaning": "A mechanism for keeping a door, lid, or container fastened, typically operated by a key or combination."},
      {"word": "Chain", "meaning": "A series of linked metallic rings or studs."},
      {"word": "Padlock", "meaning": "A detachable lock hanging by a pivoted hook through a ring on the object to be secured."},
      {"word": "Key ring", "meaning": "A ring for holding keys."},
      {"word": "Wallet chain", "meaning": "A chain attached to a wallet to prevent it from being lost or stolen."},
      {"word": "Watch strap", "meaning": "A band or bracelet that secures a watch to the wrist."},
      {"word": "Belt", "meaning": "A strip of leather or other material worn around the waist to support clothes or carry tools."},
      {"word": "Buckle", "meaning": "A frame with a hinged pin or tongue, used for joining the ends of a belt or strap."},
      {"word": "Tie", "meaning": "A long, thin piece of material worn around the neck and tied in a knot at the front, typically by men."},
      {"word": "Scarf", "meaning": "A length or square of fabric worn around the neck or head."},
      {"word": "Gloves", "meaning": "Hand coverings with separate fingers and thumb."},
      {"word": "Mittens", "meaning": "A type of glove with two sections, one for the thumb and the other for all four fingers."},
      {"word": "Socks", "meaning": "A knitted or woven covering for the foot and ankle, typically worn inside shoes."},
      {"word": "Pajamas", "meaning": "Loose-fitting clothing worn for sleeping or lounging."},
      {"word": "Robe", "meaning": "A long, loose outer garment."},
      {"word": "Slippers", "meaning": "Light, comfortable shoes that are easy to put on and take off and are intended to be worn indoors."},
      {"word": "Boots", "meaning": "Sturdy footwear covering the foot and ankle, and sometimes the leg."},
      {"word": "Sandals", "meaning": "A light shoe with straps or thongs attaching a sole to the foot."},
      {"word": "Sneakers", "meaning": "Shoes designed for sports or other forms of physical exercise but now also frequently worn as casual footwear."},
      {"word": "Heels", "meaning": "The back part of a person's foot below the ankle."},
      {"word": "Laces", "meaning": "A cord or thong used to fasten shoes or boots."},
      {"word": "Insoles", "meaning": "A removable sole inside a shoe."},
      {"word": "Shoe polish", "meaning": "A substance used to clean, shine, and protect shoes."},
      {"word": "Shoehorn", "meaning": "A curved piece of metal or plastic used to ease the foot into a shoe."},
        {"word": "Jewelry box", "meaning": "A container for storing jewelry."},
        {"word": "Necklace", "meaning": "An ornamental chain or string of beads, jewels, or links worn around the neck."},
        {"word": "Bracelet", "meaning": "An ornamental band, chain, or cord worn on the wrist or arm."},
        {"word": "Ring", "meaning": "A circular band, typically of precious metal, worn as an ornamental piece of jewelry."},
        {"word": "Earrings", "meaning": "A piece of jewelry worn on the lobe or edge of the ear."},
        {"word": "Brooch", "meaning": "An ornamental pin or clasp."},
        {"word": "Pendant", "meaning": "A piece of jewelry that hangs from a chain worn around the neck."},
        {"word": "Tiara", "meaning": "A jeweled ornamental band worn on the front of a woman's hair."},
        {"word": "Cufflinks", "meaning": "Decorative fasteners for shirt cuffs."},
        {"word": "Tie clip", "meaning": "A clip used to fasten a necktie to a shirt."},
        {"word": "Pocket watch", "meaning": "A watch designed to be carried in a pocket."},
        {"word": "Chess set", "meaning": "A set of chess pieces and a board for playing chess."},
        {"word": "Playing cards", "meaning": "A set of cards used for playing card games."},
        {"word": "Dice", "meaning": "Small cubes with each side bearing a different number of spots (from one to six), used in games involving chance."},
        {"word": "Puzzle", "meaning": "A game, toy, or problem designed to test ingenuity or knowledge."},
        {"word": "Toy car", "meaning": "A miniature model of a car, used as a toy."},
        {"word": "Doll", "meaning": "A small model of a human figure, typically a child or baby, used as a toy."},
        {"word": "Teddy bear", "meaning": "A soft toy bear."},
        {"word": "Kite", "meaning": "A toy consisting of a light frame with thin material stretched over it, flown in the wind at the end of a long string."},
        {"word": "Frisbee", "meaning": "A concave plastic disk designed for skimming through the air as an outdoor game or sport."},
        {"word": "Jump rope", "meaning": "A rope used for skipping."},
        {"word": "Swing", "meaning": "A seat suspended by ropes or chains, on which someone may swing back and forth."},
        {"word": "Slide", "meaning": "A structure with a smooth sloping surface for children to slide down."},
        {"word": "Seesaw", "meaning": "A long plank balanced in the middle on a support, on which children sit at either end and move up and down."},
        {"word": "Sandbox", "meaning": "A container filled with sand for children to play in."},
        {"word": "Garden hose", "meaning": "A flexible pipe for conveying water, used especially for watering gardens and lawns."},
        {"word": "Sprinkler", "meaning": "A device for spraying water."},
        {"word": "Shovel", "meaning": "A tool with a broad blade and a handle, used for digging, scooping, or lifting material."},
        {"word": "Rake", "meaning": "A tool with a toothed bar or tines, used to gather leaves or debris, loosen soil, or for other gardening purposes."},
        {"word": "Wheelbarrow", "meaning": "A small cart with a single wheel at the front and two handles at the rear, used for carrying loads."},
        {"word": "Flowerpot", "meaning": "A container in which to grow plants."},
        {"word": "Watering can", "meaning": "A container with a handle and a spout, used for watering plants."},
        {"word": "Bird feeder", "meaning": "A container for holding food for birds."},
        {"word": "Birdhouse", "meaning": "A small shelter for birds to nest in."},
        {"word": "Fence", "meaning": "A barrier enclosing or bordering an area of land, typically made of wooden or metal posts joined by wire or boards."},
        {"word": "Gate", "meaning": "A hinged barrier used to close an opening in a wall, fence, or hedge."},
        {"word": "Mailbox", "meaning": "A box into which mail is deposited for collection."},
        {"word": "Doormat", "meaning": "A mat placed in front of a door, used for wiping the feet."},
        {"word": "Wind chime", "meaning": "A decorative arrangement of pieces of metal or glass suspended so as to produce a chiming sound when blown by the wind."},
        {"word": "Hammock", "meaning": "A bed or couch made of canvas or rope mesh with supports at each end."},
        {"word": "Barbecue grill", "meaning": "A cooking appliance consisting of a metal frame with a grill on which food is cooked by radiant heat."},
        {"word": "Picnic basket", "meaning": "A basket used for carrying food for a picnic."},
        {"word": "Cooler", "meaning": "A container for keeping food or drink cool."},
        {"word": "Lantern", "meaning": "A portable lamp, typically with a glass case surrounding the light."},
        {"word": "Binoculars", "meaning": "An optical instrument with lenses for both eyes, used for viewing distant objects."},
        {"word": "Telescope", "meaning": "An optical instrument designed to make distant objects appear nearer, containing an arrangement of lenses, or of curved mirrors and lenses, by which rays of light are collected and focused to form a magnified image."},
        {"word": "Fishing rod", "meaning": "A long, flexible rod used with a line for catching fish."},
        {"word": "Fishing net", "meaning": "A net used for catching fish."},
        {"word": "Tent", "meaning": "A portable shelter made of cloth, supported by poles and ropes."},
        {"word": "Sleeping bag", "meaning": "A warm, padded bag for sleeping in, especially when camping."},
        {"word": "Campfire", "meaning": "A fire built outdoors for cooking or warmth."},
        {"word": "Hiking boots", "meaning": "Sturdy boots designed for hiking."},
        {"word": "Walking stick", "meaning": "A stick used for assistance in walking."},
        {"word": "First-aid kit", "meaning": "A set of medical supplies for treating minor injuries or illnesses."},
        {"word": "Whistle", "meaning": "A clear, high-pitched sound made by forcing breath through a small hole between one's lips, or a device that produces such a sound."},
        {"word": "Bin", "meaning": "A container for rubbish."},
        {"word": "Broom", "meaning": "A brush with a long handle, used for sweeping."},
        {"word": "Mop", "meaning": "An implement consisting of a bundle of thick strings or a sponge attached to a handle, used for cleaning floors."},
        {"word": "Dustpan", "meaning": "A short-handled pan into which dust is swept."},
        {"word": "Vacuum cleaner", "meaning": "An electrical appliance that cleans floors and other surfaces by sucking up dust and dirt."},
        {"word": "Iron", "meaning": "A tool or appliance with a heated flat surface, used to smooth clothes, sheets, etc."},
        {"word": "Ironing board", "meaning": "A long, narrow padded board on which clothes are ironed."},
        {"word": "Washing machine", "meaning": "An electrical appliance for washing clothes."},
        {"word": "Dryer", "meaning": "An electrical appliance for drying clothes."},
        {"word": "Dishwasher", "meaning": "An electrical appliance for washing dishes."},
        {"word": "Oven", "meaning": "An enclosed compartment for cooking or heating food."},
        {"word": "Stove", "meaning": "An apparatus for cooking or heating, typically fueled by electricity or gas."},
        {"word": "Refrigerator", "meaning": "An appliance used to keep food and drinks cool."},
        {"word": "Freezer", "meaning": "An appliance used to freeze food and drinks."},
        {"word": "Toaster", "meaning": "An electrical appliance for toasting bread."},
        {"word": "Microwave oven", "meaning": "An oven that uses microwaves to heat or cook food."},
        {"word": "Blender", "meaning": "An electric machine with whirling blades used for chopping, mixing, or pureeing food."},
        {"word": "Coffee maker", "meaning": "An electrical appliance for making coffee."},
        {"word": "Kettle", "meaning": "A container with a handle and a spout, used for boiling water."},
        {"word": "Food processor", "meaning": "An electric kitchen appliance used for chopping, slicing, or mixing food."},
        {"word": "Cutting board", "meaning": "A durable board on which food can be cut."},
          {"word": "Tiffin box", "meaning": "A multi-tiered container used for carrying meals, common in India."},
          {"word": "Dhoti", "meaning": "A traditional men's garment consisting of a long piece of cloth wrapped around the waist and legs."},
          {"word": "Saree", "meaning": "A traditional women's garment consisting of a long piece of cloth draped around the body."},
          {"word": "Kurta", "meaning": "A loose collarless shirt worn in many regions of South Asia, typically made of cotton or silk."},
          {"word": "Salwar Kameez", "meaning": "A traditional outfit worn by women, consisting of loose trousers and a tunic."},
          {"word": "Churidar", "meaning": "Trousers that are tight-fitting around the calves and ankles."},
          {"word": "Pagri", "meaning": "A turban worn by men, especially in Rajasthan and Punjab."},
          {"word": "Bindi", "meaning": "A decorative mark worn in the center of the forehead, especially by Hindu women."},
          {"word": "Mangalsutra", "meaning": "A sacred necklace worn by married Hindu women."},
          {"word": "Mehndi", "meaning": "Temporary body art made with henna, typically applied during festivals and weddings."},
          {"word": "Kalash", "meaning": "A metal pot with a wide base and a small mouth, often used in Hindu rituals."},
          {"word": "Diya", "meaning": "A small oil lamp, typically made of clay, used during Diwali and other festivals."},
          {"word": "Rangoli", "meaning": "Colorful patterns created on the floor using colored powders, flowers, or rice, often during festivals."},
          {"word": "Toran", "meaning": "A decorative door hanging, often made of flowers or fabric."},
          {"word": "Japa mala", "meaning": "A string of beads used for meditation and chanting mantras."},
          {"word": "Harmonium", "meaning": "A keyboard instrument with bellows, used in Indian classical music."},
          {"word": "Tabla", "meaning": "A pair of Indian drums used in Hindustani classical music."},
          {"word": "Sitar", "meaning": "A plucked stringed instrument used in Hindustani classical music."},
          {"word": "Tanpura", "meaning": "A long-necked plucked string instrument used to provide a drone in Indian classical music."},
          {"word": "Mridangam", "meaning": "A double-headed drum used in Carnatic classical music."},
          {"word": "Shehnai", "meaning": "A double reed wind instrument used in Indian classical music and ceremonies."},
          {"word": "Paan daan", "meaning": "A container for storing betel leaves and related ingredients."},
          {"word": "Incense sticks (Agarbatti)", "meaning": "Sticks of fragrant material that are burned to produce a pleasant smell."},
          {"word": "Camphor (Kapur)", "meaning": "A white crystalline substance with a strong aromatic smell, used in religious ceremonies and as an insect repellent."},
          {"word": "Rudraksha beads", "meaning": "Seeds of the Rudraksha tree, used for making prayer beads and malas."},
          {"word": "Kajal", "meaning": "A black substance used to darken the eyelids, often used as a cosmetic or for medicinal purposes."},
          {"word": "Attar", "meaning": "A natural perfume oil derived from botanical sources."},
          {"word": "Lota", "meaning": "A small metal pot used for carrying water, especially in rural areas."},
          {"word": "Charpai", "meaning": "A traditional woven bed, typically made of wood and rope."},
          {"word": "Handi", "meaning": "A deep, wide-mouthed cooking pot, often made of clay or metal."},
          {"word": "Tandoor", "meaning": "A cylindrical clay oven used for cooking naan bread and tandoori dishes."},
          {"word": "Charkha", "meaning": "A spinning wheel used for spinning cotton or wool, associated with Mahatma Gandhi."},
          {"word": "Khadau", "meaning": "Wooden sandals with a knob for gripping between the toes."},
          {"word": "Jutti", "meaning": "Traditional Indian footwear, often decorated with embroidery."},
          {"word": "Pichwai", "meaning": "A traditional Indian painting style, often depicting scenes from the life of Lord Krishna."},
          {"word": "Madubhani painting", "meaning": "A traditional Indian folk art style from Bihar, characterized by geometric patterns and vibrant colors."},
          {"word": "Warli painting", "meaning": "A tribal art form from Maharashtra, characterized by simple geometric shapes and stick figures."},
          {"word": "Tanjore painting", "meaning": "A classical South Indian painting style, characterized by the use of gold leaf and precious stones."},
          {"word": "Kalamkari", "meaning": "A traditional Indian textile art, involving hand-painting or block-printing on cotton or silk fabric."},
          {"word": "Bandhani", "meaning": "A tie-dye textile technique, creating intricate patterns on fabric."},
          {"word": "Zardozi", "meaning": "An embroidery technique using gold or silver threads."},
          {"word": "Bidriware", "meaning": "A metal handicraft from Bidar, Karnataka, characterized by black metal inlaid with silver."},
          {"word": "Channapatna toys", "meaning": "Wooden toys and dolls made in Channapatna, Karnataka."},
          {"word": "Kashmiri carpets", "meaning": "Handmade carpets from Kashmir, known for their intricate designs and fine quality."},
          {"word": "Pashmina shawl", "meaning": "A fine wool shawl made from the fleece of the Changthangi goat, found in the Himalayas."},
          {"word": "Brass lamps", "meaning": "Lamps made of brass, often used in religious ceremonies and as decorative items."},
          {"word": "Idli steamer", "meaning": "A multi-tiered steamer used for making idlis, a South Indian breakfast dish."},
          {"word": "Dosa tawa", "meaning": "A flat griddle used for making dosas, a South Indian pancake."},
          {"word": "Appam maker", "meaning": "A pan used for making appams, a South Indian pancake with crispy edges and a soft center."},
          {"word": "Pressure cooker", "meaning": "A cooking appliance used to cook food quickly using steam under pressure, very common in Indian kitchens."},
          {"word": "Spice box (Masala dabba)", "meaning": "A round container with small compartments for storing spices."},
          {"word": "Mortar and pestle (Sil batta)", "meaning": "A set of tools used for grinding spices and herbs."},
          {"word": "Rolling board (Chakla) and pin (Belan)", "meaning": "A set of tools used for rolling out dough for rotis and chapatis."},
          {"word": "Coconut scraper", "meaning": "A tool used for scraping coconut flesh."},
          {"word": "Jaggery (Gur)", "meaning": "A traditional unrefined sugar made from sugarcane or palm sap."},
          {"word": "Pickle jar (Achar barni)", "meaning": "A jar used for storing pickles."},
          {"word": "Clay water pot (Matka)", "meaning": "A pot made of clay, used for storing and cooling water."},
          {"word": "Hand fan (Pankha)", "meaning": "A handheld device used to create a breeze."},
          {"word": "Mosquito net (Machhardani)", "meaning": "A net used to protect against mosquitoes."},
          {"word": "Street food cart (Thela)", "meaning": "A mobile cart used for selling street food."},
          {"word": "Auto rickshaw", "meaning": "A three-wheeled motorized vehicle used for transportation."},
          {"word": "Bullock cart (Bailgadi)", "meaning": "A two-wheeled cart pulled by bullocks, used for transportation in rural areas."},
          {"word": "Camel cart (Untgadi)", "meaning": "A two-wheeled cart pulled by camels, used for transportation in desert areas."},
          {"word": "Elephant howdah", "meaning": "A seat placed on the back of an elephant, used for carrying people."},
          {"word": "Snake charmer's flute (Pungi)", "meaning": "A wind instrument used by snake charmers."},
          {"word": "Kavadi", "meaning": "A decorated structure carried by devotees during the Thaipusam festival."},
          {"word": "Dabbawala's bicycle", "meaning": "A bicycle used by dabbawalas to deliver tiffin boxes in Mumbai."},
          {"word": "Chai glass", "meaning": "A small glass used for serving chai (tea)."}
        ]